{
    "comments": [
        {"com": "My bf is trying to apply for a B2 tourist visa via the DS-160 form. The site is timing out repeatedly and he can’t even get the information inputted, nor does he have time to save it before the error happens. He has tried FireFox, Chrome, Chrome Incognito…nothing is working and he’s getting discouraged. I saw this question was asked 5 years ago, but wanted to ask if anyone has any up-to-date suggestions on how to get around the time outs. Thank you!"},
        {"com": "I can feel my longevity decay significantly every time I have to file a DS-160. It's impossible to fill it out in one go even tho if you have all information in hand - the mechanism is set to be a 'fuck you scrapers & fuck you too foreigners'"},
        {"com": "The DS-160 times out your session if you spend a lot of time within the application (reading or writing responses) without saving. This can cause a lot of lost work, particularly when typing long answers."},
        {"com": "One more issue is, its not allowing to paste the details in the form. For example in the section where you need to enter the job duties, we need to enter lot of text and since its not allowing to paste the details and it expires in a min, need type each line and save it, comeback and type again."},
        {"com": "i've tried to fill the  DS 160 so many times that i can't count. Every time i begin , after filling the first page, appears the same message: session time out"},
        {"com": "I’m trying to apply for a US visa but the DS-160 form keeps giving me “Session time out” so I cant finish it. Has this happened to anyone ? Is it just not working or should I wait and try again later ?"},
        {"com": "We have been attempting to fill the DS-160 form for a visitor visa. The form times out in a very short time (hardly 2 – 3 minutes)."},
        {"com": "yes, all I did was name, surname, and attach the photo. Got the case number so I can retrieve it..... I then clicked next when it was approved, and boom, I was timed out"},
        {"com": "It is notoriously frustrating. The random timeouts, session drops, and lack of autosave make it way harder than it needs to be. Sometimes the site is just overloaded and there's nothing you can do."},
        {"com": "I'm stuck in a loop of filling out all the info, having it time out and expire, logging back in to the same page, to just have the same problem again..."},
        {"com": "For the last two weeks I have been trying to fill DS-160 online form for nonimmigrant visa application. My work keeps getting interrupted, incessantly and out of the blue, with the 'session has timed out'. I don't know what is causing it. I have all the information necessary at hand to fill the document and so I am not inactive for more than 10 seconds at a time."},
        {"com": "I started a new DS160 application ID, but it timed out after submitting the 'secret question' screen. Like that, I created 3 more DS160 application IDs, but each one timed out after submitting the 'secret question' screen."},
        {"com": "Just started filling out the first page, then i had to print my Application ID and to answer one question. When I click on 'Continue' a window pops up with 'Session time out'. "},
        {"com": "I get to the first part of the application (name and date of birth) and when I press NEXT, it takes me to a page that says 'Session has timed out'. I attempted to retrieve the application 4 times on different browsers and same thing happens."},
        {"com": "I have tryied several times to fill the online application form but cannot go further than page 1, time out every time I tried. Is there someone who can help me?"}
    ]
}