{
    "stories": [
        {"story": 
            {   
                "src" : "assets/images/collage-01.jpg",
                "txt" : ["After the company I worked for laid me off, my TN visa became invalid and I entered the 60-day grace period after which I would have to leave the country. Having to sell my new car, my new house, and planning all the moving logistics without a job became stressful. Me and my family packed 11 boxes including shoes, clothes, and linens to be sent to Colima (MX).","We bought an old SUV and a friend of ours (who had another one) offered to help us move our valuable belongings to Monterrey (MX). However, once at the border, he didn't have the right permit to drive his SUV into Mexico, so we ended up in Laredo, TX.", "We rented a storage unit and looked for moving services, but everything was too expensive. So, we drove our SUV with some items across the border, but we were very scared because the border is quite unsafe. We asked some Mexican teenagers we encountered on the road 'Which port of entry did you cross on your way here?' and they mentioned Puente Colombia. We got some courage, and drove to that one.", "When we had just crossed the border, the SUV broke down right by the time we reached the first toll. We called our families in Monterrey, and they escorted us the rest of the way. We took the SUV to the mechanic, got it fixed and went back to the border and...prayed we could be let in again (since our visas were no longer valid after we left US).", "In Mexico, we were lucky the customs officer didn't inspect our vehicle, otherwise we would've had to pay something there too. I remember I had packed a BB fun (which looked very real) and my wife was scared it as gonna cause us trouble even if we tossed it in the trash. So, we went to the closest police station to drop it off voluntarily.", "The police officer at the desk told us to wait for a bit, and then asked us to follow him 'cause he was interested in purchasing the gun. So, we left the police station and walked a couple of blocks away. By then, I told him I just really wanted to get rid of it so he could have it for free. He asked why and we explained the whole situation. The officer told us he was married to a 'dreamer', and that he was also scared about what could happen to his family.", "He told us about a cousin he had who owned a truck and carried short distance move-out trips to Monterrey. We were afraid the cousin would screw us up once we all crossed the border, but we just put our faith in God and decided to make the deal and everything turned out fine. We moved the rest of our stuff into Mexico, and never plan to go back to US.", "It's kinda sad to leave your house and go back to depend on your parents or their own home. But we have faith that we'll get back on our feet again."]
            }
        },
        {"story": 
            {
                "src" : "assets/images/test2.jpg",
                "txt" : ["Every year I would go renew my TN visa totally assured that it was going to get renewed. After the 3rd time, it was almost like a piece of cake. I thought it was a very remote possibility to get it denied until...that day came and I was unable to go back.", "One person's decision can change all your plans, or, well, you can't actually make any medium or long term plans because you know you're always at risk of having to go back immediately."]
            }
        },
        {"story": 
            {
                "src" : "assets/images/collage-03.jpg",
                "txt" : ["For me, it was always having those thoughts in the back of my mind: that they'll deny me a renewal, that my project would get cut and I would have to move to another city to find one, that my project would end and I wouldn't find another job and I would have to move back to Mexico which...is what ended up happening", "The paperwork to come back was a pain. DHL sent some documents to Netherlands (NL) instead of Monterrey, NL ('NL' stands for Nuevo Leon, a state in Mexico), so I had to 'fix' that by paying extra...and without a job. I paid because my musical instruments are my life.", "I was scared my boxes were going to be opened by customs in Mexico and that they would steal expensive stuff. Almost had a heart attack when a box was labeled 'guitar' but no guitar was there. They had just mislabeled it.", "In the end, all my stuff made it home."]
            }
        },
        {"story": {
            "src" : "assets/images/test2.jpg",
            "txt": ["We started our journey back in Milpitas, CA. We rented a U-Haul, and drove all the way down to San Diego. From there, the plan was to cross to Tijuana and drive to Monterrey. Unfortunately, the damn customs officers in Mexico took my husband hostage.", "First, when we arrived to their office, he handed in the paperwork and they made him wait for 2 hours until he asked if there was anything missing. They replied with 'Missing what? You haven't provided anything to us'. From there, they took him to another office where he saw how they opened our boxes and took everything out. Finally, they told him 'If you want to cross the border, you're going to have to come with us to an ATM'.", "At the ATM, they told him to  withdraw everything in the account. Fortunately, there was a limit per day. Otherwise, we would've ran out of money. The guy who helped us move our stuff from San Diego to Tijuana was also in with the customs. The moving service to Monterrey was waiting for us in Tijuana, but this person was the one holding the permit to move our stuff across the border.", "He wanted us to give show him the route that the moving service was going to take, to 'escort' that truck, but the moving service knew this was a tactic thieves use to rob people on the road. Knowing this, they have more than one truck with stuff they will move and they use others as decoys.", "Meanwhile, I had to sell my SUV (because  it couldn't cross into Mexico due to a restriction with the model) and I left in in San Diego. Some friends of hours helped me and my kids move our luggage, buuut -because it was a pick-up truck- we couldn't all fit in. So we took a couple of trips to cross. First, I went with my friend's husband. He went back to pick our luggage and my kids, and in the last trip he picked his kids and the rest of this family. ", "My husband and I were very shaken when eventually met and I came to know his oddisey at customs. By then, we didn't trust anyone anymore. Fortunately, my children were alright, our stuff got delivered 2 days later (although customs did steal some of our stuff). ", "My suggestion is to get rid of everything. All the system is rotten in Mexico and it makes something which is supposed to be simple become a nightmare."]
            }
        },
        {"story": {
            "src" : "assets/images/test2.jpg",
            "txt": ["this is a tetst", "And more test"]
            }
        }
        
    ]
}